import 'package:flutter/material.dart';

class noubatauti extends StatefulWidget {
  const noubatauti({super.key});

  @override
  State<noubatauti> createState() => _noubatautiState();
}

class _noubatautiState extends State<noubatauti> {
  @override
  Widget build(BuildContext context) {
    return Directionality(textDirection: TextDirection.rtl, child: Scaffold(
      body: ListView(
        children: [
          const Image(image: AssetImage('assets/images/ch7.jfif'), fit: BoxFit.cover,),
          Padding(
            padding: const EdgeInsets.all(14),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,

              children: [
                const Text('نوبات الغضب عند الأطفال التوحديين', style: TextStyle(fontSize: 28,fontWeight: FontWeight.bold,color: Colors.black54),),
//////////////////////////////
                const SizedBox(height: 10,),
////////////////////////////////////
                const Text('''يتميّز الطفل المصاب بمرض التوحد بمزاجه المتقلّب والصعب وهذا مايجعله يُصاب بالتوتر والغضب لمجرد أنّه تعرض لموقفٍ ما أو لحالةٍ معينة أزعجته وهذا مايُسبب للأهل العديد من المشاكل النفسيّة وذلك لعدم قدرتهم على ضبط تصرفات وانفعالات طفلهم، ومن هذا المنطلق سنقدم فيمايلي مجموعة من النصائح المهمة التي ستُساعدك على تهدئة غضب طفلك المتوحد.''',
                  style: TextStyle(fontSize: 25,color: Colors.blueGrey),),
                const Text('''اعرف ما الذي يحفز نوبة الانهيار.'''),
                const Text('''التوصُّل للسبب يمكن أن يساعدك على إبعاد الطفل عما يغضبه. هذا مهم لتهدئة طفل توحدي. راقب طفلك وحاول أن تعرف المحفزات لسلوكيات معينة يقوم بها
إذا كان الأهل أو الشخص الذي يقوم بالرعاية مدركًا لما يثير الطفل، سيكون بإمكانه تجنبه.احتفظ بِنُوْتة لتدون فيها ما يثير الطفل عادةً حتى تساعدك على اتقّاء تحفيز الانهيارات. قد تفكر كذلك باستخدام تطبيق على هاتف ذكي لتوثق الانهيارات وأسبابها.
من المحفزات الشائعة للانهيارات عند الأطفال التوحديون: التغييرات أو الخلل في روتينهم المعتاد، والتنبيه المفرط، والإحباط، وصعوبة التواصل.[٢]
الانهيارات مختلفة عن نوبات الغضب. نوبة الغضب هي وسيلة مُتعمّدة من الطفل ليؤثر بك ويحصل على ما يريد، وتتوقف حالما تستسلم له. أما الانهيار يحدث عندما يصبح الشخص التوحدي متوترًا بشدة حتى أنه يفقد القدرة على التحكم بنفسه ويشعر بالضعف، ولا يتوقف الانهيار حتى تكتمل النوبة.
'''),
                const Text('التزم بروتين.'),
                const Text('''عندما يوجد روتين يتبعه الطفل، يكون بإمكانه توقع ما سيحدث. يساعد هذا على الحفاظ على هدوء الطفل.الجداول المزودة بالرسوم يمكن أن تساعد الطفل على رؤية ما سيحدث لبقية اليوم أو الأسبوع.
إذا كنت تعرف أن تغيرات ستطرأ على الروتين في يوم معين، تأكد أن تأخذ وقت لتهيئة الطفل. تحدث معه مسبقًا واجعله يفهم هذه التغييرات بوضوح وبصبر.
عندما تعرّف ابنك على بيئة أو محيط جديد، من الأفضل أن تقدم له المكان عندما توجد به مثيرات أقل. يعني هذا أن تجلب ابنك للمكان في وقت تقل به الضوضاء ويوجد به أشخاص أقل.
'''),
                const Text('تحدث مع ابنك بوضوح'),
                const Text('''التواصل بالكلام يعتبر مصدر إحباط للكثير من الأطفال التوحديين. تحدث بصبر واحترام واجعل نطقك للكلام واضحًا.تجنب الصراخ أو التحدُّث بنبرة عدائية، لأن هذا قد يجعل الانهيار أسوأ.
إذا كان التواصل الكلامي صعبًا على طفلك، حاول أن تتواصل معه بالصور أو باستخدام نوع آخر من طرق التواصل المعززة والبديلة للتوحديين
AAC
تذكر أن التواصل يعني أن يتاح التعبير للطرفين. استمع دائمًا لطفلك واجعل تقديرك واحترامك لما يقوله واضحًا. اسأله أسئلة للاستيضاح إذا كان هناك ما تحتاج لفهمه، حتى تتجنب الانهيارات الناتجة عن الإحباط'''),
                const Text('شتت الطفل إذا كنت تعتقد أن السبب عاطفي/نفسي'),
                const Text('''عندما يكون طفلك غاضبًا، يكون أحيانًا من الممكن أن تهدئه عن طريق تحويل انتباهه لشيء آخر. جرب اللعب بحماسة بلعبته المفضلة أو تشغيل الفيديو المفضّل له أو الاستماع لأغنيته المفضلة. حاول أن تستعن بأكثر ما يحبه الطفل إذا أمكن التشتيت لن يُفلح كل مرة. على سبيل المثال: سؤال أختك عن تجميعتها من الأحجار يمكن أن ينجح في تشتيتها عن الخوف من حقنة تطعيم الإنفلونزا، لكنه لن يصلح الوضع إذا كانت مشكلتها هي أنها تشعر بقماش فستانها كأنه نمل ناري على بشرتها.
ما إن يعود الطفل للهدوء، سيكون من الجيد أن تتحدث معه عمّا أغضبه أو أثاره في المقام الأول. اسأله ماذا حدث واعمل معه على إيجاد طرق لمنع هذا من التكرُّر.
'''),
                const Text('غيّر الأشياء الموجودة في محيط الطفل'),
                const Text('''قد يكون طفلك غاضبًا لأنه شديد الحساسية وهناك ما يحفزه. عندما يحدث ذلك، ستكون فكرة جيدة أن تقوم ببساطة بنقل الطفل لمكان مختلف أو تغير شيئًا في محيطه (مثل إطفاء موسيقى عالية الصوت) حتى تقلل فرط التنبيه.مثلًا إذا تضايق الطفل في غرفة مضاءة بمصابيح فلوريسنت، من الأفضل أن تأخذه لغرفة بها إضاءة مغايرة، بدلًا من إجباره على التكيّف عليها.
إذا كان ابنك في مكان لا يمكن تغييره بسهولة، خذ احتياطاتك. يمكنك مثلًا أن تعطي الطفل نظارة شمس (للوقاية من الحساسية تجاه الضوء) أو سدادات أذن يرتديها في الأماكن العامة (لإبعاد الضوضاء). فكر مع طفلك في الاحتياطات السابقة الممكنة لتستخرجا سويًا بعض الأفكار المفيدة.
'''),
                const Text('منح طفلك بعض المساحة.'),
                const Text('''أحيانًا يكون كل ما يحتاجه الطفل هو قليل من الوقت حتى يشعر بأنه مستعد للتواصل ثانيةً مع العالم.  جرب أن تدعه يجلس لبعض الوقت حتى يهدأ، عادةً في منطقة بها محفزات حسية قليلة.ضع السلامة في حسبانك. لا تترك طفلًا صغيرًا وحده أو تغلق عليه غرفة دون مراقبة مهما حدث. تأكد أن الطفل بأمان وبإمكانه المغادرة متى ما أراد.''')

              ],),
          )
        ],
      ),


    ));
  }
}